
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user Stata license expires 19 Mar 2019:
       Serial number:  301509290780
         Licensed to:  Travis Williams
                       University of Colorado Boulder

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.

. do "G:\My Drive\NOT THESIS\Shrum-Williams\project\STATA\models\py_template.do
> " "xtreg logweight L12.logweight winter1 spring1 summer1 fall1 winter2 spring
> 2 summer2 fall2 i.time" data\tables\rmw\py_temp.csv logweight 

. //clear everything out
. clear all

. 
. //Set variables from subroutine calls
. local formula `1' //Includes function, up to comma

. local which `2' // Two files, one temp for aggregatation & one to stay the sa
> me

. 
. //Increase matrix size
. set matsize 600

. 
. // import data
. import delimited `which'
(79 vars, 5,604 obs)

. local y `3'

. display y
103340.52

. 
. 
. // Set date and time 
. egen id = group(polyid)

. g time = ym(year,month)

. xtset id time
       panel variable:  id (unbalanced)
        time variable:  time, 504 to 702, but with gaps
                delta:  1 unit

. 
. /////////////////////////////////////////////////////////////////////////////
> ///
> //////////////////////////////// Model #1 ///////////////////////////////////
> ///        
> /////////////////////////////////////////////////////////////////////////////
> ///
> 
. eststo: `formula' , fe vce(robust) 

Fixed-effects (within) regression               Number of obs     =      4,960
Group variable: id                              Number of groups  =         40

R-sq:                                           Obs per group:
     within  = 0.7091                                         min =          9
     between = 0.9563                                         avg =      124.0
     overall = 0.7279                                         max =        186

                                                F(39,39)          =          .
corr(u_i, Xb)  = 0.3287                         Prob > F          =          .

                                    (Std. Err. adjusted for 40 clusters in id)
------------------------------------------------------------------------------
             |               Robust
   logweight |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   logweight |
        L12. |   .5108626   .0494057    10.34   0.000     .4109301    .6107952
             |
     winter1 |   .0173522    .009286     1.87   0.069    -.0014305    .0361348
     spring1 |   .0031667   .0077598     0.41   0.685     -.012529    .0188625
     summer1 |  -.0029164   .0126115    -0.23   0.818    -.0284256    .0225928
       fall1 |  -.0106207   .0090312    -1.18   0.247    -.0288879    .0076466
     winter2 |    .005358   .0066015     0.81   0.422    -.0079948    .0187107
     spring2 |   -.001162   .0078372    -0.15   0.883    -.0170143    .0146902
     summer2 |   .0018773    .011481     0.16   0.871    -.0213452    .0250999
       fall2 |   .0009178   .0104074     0.09   0.930    -.0201332    .0219688
             |
        time |
        517  |   .0119317   .0112585     1.06   0.296    -.0108408    .0347041
        518  |   .0277114   .0104584     2.65   0.012     .0065573    .0488655
        519  |    .030597   .0090411     3.38   0.002     .0123098    .0488843
        520  |   .0147711   .0183751     0.80   0.426    -.0223961    .0519382
        521  |    .013972   .0217127     0.64   0.524    -.0299461    .0578901
        522  |   .1123513   .0555558     2.02   0.050    -.0000208    .2247235
        523  |   .1482852   .0233525     6.35   0.000     .1010504      .19552
        524  |   .0770824   .0240021     3.21   0.003     .0285336    .1256312
        525  |  -.0723028   .0202211    -3.58   0.001     -.113204   -.0314017
        526  |  -.0749546   .0145283    -5.16   0.000    -.1043408   -.0455684
        527  |  -.0448194   .0137345    -3.26   0.002    -.0726002   -.0170387
        528  |   .0297121   .0081734     3.64   0.001     .0131799    .0462444
        529  |   .0220901   .0081747     2.70   0.010     .0055552     .038625
        530  |   .0123389   .0090183     1.37   0.179    -.0059024    .0305802
        531  |   .0149639   .0091728     1.63   0.111    -.0035899    .0335177
        532  |   .0578493   .0139686     4.14   0.000     .0295951    .0861035
        533  |   .0783246    .026679     2.94   0.006     .0243612     .132288
        534  |   .0293176   .0276363     1.06   0.295     -.026582    .0852173
        535  |   .0471505   .0285496     1.65   0.107    -.0105966    .1048976
        536  |   .0445719   .0200134     2.23   0.032      .004091    .0850529
        537  |  -.0230092   .0142376    -1.62   0.114    -.0518073     .005789
        538  |  -.0249172   .0150697    -1.65   0.106    -.0553986    .0055642
        539  |  -.0099644   .0091728    -1.09   0.284    -.0285181    .0085893
        540  |    .016163   .0066128     2.44   0.019     .0027873    .0295387
        541  |   .0269145   .0076829     3.50   0.001     .0113744    .0424547
        542  |    .048557   .0104554     4.64   0.000      .027409    .0697049
        543  |   .0614207   .0111517     5.51   0.000     .0388643    .0839771
        544  |   .0628268   .0144976     4.33   0.000     .0335027    .0921509
        545  |   .0873951   .0327826     2.67   0.011     .0210861    .1537041
        546  |   .1144489    .024419     4.69   0.000     .0650568    .1638411
        547  |   .1085841   .0262308     4.14   0.000     .0555272    .1616409
        548  |   .0952462   .0198701     4.79   0.000     .0550552    .1354373
        549  |  -.0346266   .0143508    -2.41   0.021    -.0636539   -.0055993
        550  |  -.0694053   .0106821    -6.50   0.000    -.0910118   -.0477987
        551  |  -.0253254   .0106732    -2.37   0.023    -.0469141   -.0037368
        552  |  -.0021526   .0069342    -0.31   0.758    -.0161783    .0118732
        553  |   .0251708   .0081276     3.10   0.004     .0087312    .0416104
        554  |   .0251653   .0109368     2.30   0.027     .0030434    .0472871
        555  |   .0309425   .0117849     2.63   0.012     .0071052    .0547798
        556  |   .0359079   .0171259     2.10   0.043     .0012675    .0705483
        557  |   .0560759   .0229434     2.44   0.019     .0096685    .1024832
        558  |   .0732602   .0188537     3.89   0.000      .035125    .1113953
        559  |   .0161132   .0356861     0.45   0.654    -.0560688    .0882951
        560  |  -.0804876   .0194019    -4.15   0.000    -.1197317   -.0412434
        561  |   -.073573   .0112386    -6.55   0.000    -.0963052   -.0508409
        562  |  -.0397275   .0118809    -3.34   0.002    -.0637589   -.0156962
        563  |  -.0141339   .0098994    -1.43   0.161    -.0341573    .0058896
        564  |   .0248238   .0085096     2.92   0.006     .0076115     .042036
        565  |   .0355423   .0108206     3.28   0.002     .0136556    .0574291
        566  |    .025509   .0096928     2.63   0.012     .0059034    .0451147
        567  |   .0158758   .0134795     1.18   0.246     -.011389    .0431406
        568  |   .0432489   .0149251     2.90   0.006     .0130599    .0734378
        569  |   .0612288   .0293234     2.09   0.043     .0019166     .120541
        570  |   .0943687    .026969     3.50   0.001     .0398186    .1489187
        571  |   .1086523   .0368068     2.95   0.005     .0342035     .183101
        572  |   .1084119   .0146077     7.42   0.000     .0788651    .1379587
        573  |  -.0480321   .0154159    -3.12   0.003    -.0792137   -.0168506
        574  |  -.0676612   .0111773    -6.05   0.000    -.0902694   -.0450529
        575  |  -.0554813   .0082824    -6.70   0.000     -.072234   -.0387285
        576  |  -.0145401    .006579    -2.21   0.033    -.0278473   -.0012329
        577  |  -.0001406    .008854    -0.02   0.987    -.0180495    .0177683
        578  |   .0097552   .0085123     1.15   0.259    -.0074625    .0269728
        579  |   .0339642   .0104129     3.26   0.002     .0129021    .0550262
        580  |   .0285284   .0140514     2.03   0.049     .0001069      .05695
        581  |   .0227913   .0188524     1.21   0.234    -.0153412    .0609239
        582  |   .0882499   .0166534     5.30   0.000     .0545652    .1219346
        583  |   .0705156   .0177585     3.97   0.000     .0345957    .1064356
        584  |   .0961785   .0192083     5.01   0.000     .0573261    .1350309
        585  |   .0087392   .0188082     0.46   0.645    -.0293041    .0467824
        586  |  -.0282794   .0131438    -2.15   0.038    -.0548651   -.0016936
        587  |  -.0449701   .0100457    -4.48   0.000    -.0652895   -.0246508
        588  |  -.0114296   .0072352    -1.58   0.122    -.0260641    .0032049
        589  |   -.010924    .007711    -1.42   0.165     -.026521    .0046731
        590  |   .0061887   .0097101     0.64   0.528    -.0134519    .0258293
        591  |  -.0023563   .0093748    -0.25   0.803    -.0213186     .016606
        592  |   .0112561   .0160931     0.70   0.488    -.0212952    .0438074
        593  |   .0450905   .0285065     1.58   0.122    -.0125692    .1027503
        594  |    .066928   .0328522     2.04   0.048     .0004781    .1333779
        595  |   .1193819   .0098467    12.12   0.000      .099465    .1392987
        596  |   .1020325   .0147692     6.91   0.000      .072159     .131906
        597  |  -.0113393    .013787    -0.82   0.416    -.0392262    .0165476
        598  |  -.0724484   .0111278    -6.51   0.000    -.0949564   -.0499404
        599  |  -.0551867   .0104899    -5.26   0.000    -.0764045    -.033969
        600  |  -.0197573   .0082971    -2.38   0.022    -.0365398   -.0029747
        601  |  -.0054633   .0076414    -0.71   0.479    -.0209194    .0099928
        602  |  -.0203298   .0100643    -2.02   0.050    -.0406869    .0000272
        603  |   -.009697   .0099128    -0.98   0.334    -.0297475    .0103534
        604  |   .0204655   .0118609     1.73   0.092    -.0035255    .0444564
        605  |   .0487757   .0210335     2.32   0.026     .0062314    .0913199
        606  |   .0934214   .0224475     4.16   0.000     .0480172    .1388257
        607  |   .0621057   .0184511     3.37   0.002     .0247849    .0994265
        608  |    .055441    .018541     2.99   0.005     .0179383    .0929437
        609  |   -.056689   .0130129    -4.36   0.000    -.0830101   -.0303679
        610  |  -.0801292   .0118821    -6.74   0.000    -.1041631   -.0560953
        611  |  -.0469414   .0094082    -4.99   0.000    -.0659712   -.0279116
        612  |  -.0160747   .0078321    -2.05   0.047    -.0319166   -.0002328
        613  |   .0066854   .0083053     0.80   0.426    -.0101138    .0234846
        614  |   .0173581   .0085697     2.03   0.050     .0000242    .0346919
        615  |   .0306405   .0089949     3.41   0.002     .0124466    .0488344
        616  |   .0577722   .0208132     2.78   0.008     .0156735    .0998709
        617  |   .0372226   .0357409     1.04   0.304    -.0350702    .1095155
        618  |    .077893   .0265993     2.93   0.006     .0240907    .1316952
        619  |   .1001495   .0198848     5.04   0.000     .0599288    .1403702
        620  |   .0999314   .0193818     5.16   0.000     .0607281    .1391347
        621  |  -.0178072   .0162426    -1.10   0.280     -.050661    .0150466
        622  |  -.0531457   .0145539    -3.65   0.001    -.0825838   -.0237076
        623  |  -.0476481    .011307    -4.21   0.000    -.0705186   -.0247776
        624  |  -.0019131    .007374    -0.26   0.797    -.0168285    .0130022
        625  |   .0104993   .0085788     1.22   0.228    -.0068529    .0278516
        626  |   .0071208   .0099518     0.72   0.479    -.0130086    .0272502
        627  |   .0206114   .0110374     1.87   0.069     -.001714    .0429367
        628  |   .0287026   .0154555     1.86   0.071    -.0025592    .0599644
        629  |   .0599244   .0120448     4.98   0.000     .0355614    .0842874
        630  |    .059574   .0203455     2.93   0.006     .0184213    .1007267
        631  |   .0212084   .0242918     0.87   0.388    -.0279265    .0703433
        632  |   -.083585   .0227354    -3.68   0.001    -.1295717   -.0375982
        633  |  -.1030898   .0162833    -6.33   0.000     -.136026   -.0701537
        634  |  -.0774175   .0133162    -5.81   0.000    -.1043522   -.0504829
        635  |  -.0564745   .0130115    -4.34   0.000    -.0827928   -.0301562
        636  |  -.0156769   .0100518    -1.56   0.127    -.0360086    .0046547
        637  |  -.0083537   .0156168    -0.53   0.596    -.0399418    .0232343
        638  |   .0162288   .0161567     1.00   0.321    -.0164512    .0489087
        639  |   .0415305   .0104746     3.96   0.000     .0203437    .0627173
        640  |   .0119103   .0129495     0.92   0.363    -.0142825     .038103
        641  |   .0327062   .0202114     1.62   0.114    -.0081753    .0735876
        642  |    .066864    .034431     1.94   0.059    -.0027793    .1365073
        643  |    .094608   .0233798     4.05   0.000     .0473178    .1418981
        644  |   .0967072   .0205909     4.70   0.000     .0550582    .1383562
        645  |  -.0248682   .0173266    -1.44   0.159    -.0599146    .0101782
        646  |  -.0531782   .0149532    -3.56   0.001    -.0834239   -.0229325
        647  |  -.0241347   .0138769    -1.74   0.090    -.0522034    .0039341
        648  |   .0077126    .011909     0.65   0.521    -.0163756    .0318008
        649  |   .0090287   .0130025     0.69   0.492    -.0172712    .0353287
        650  |   .0294645    .009049     3.26   0.002     .0111612    .0477678
        651  |  -.0039156   .0171667    -0.23   0.821    -.0386386    .0308074
        652  |   .0680438   .0239843     2.84   0.007     .0195309    .1165567
        653  |   .0801771   .0248546     3.23   0.003      .029904    .1304502
        654  |   .1015358   .0277593     3.66   0.001     .0453872    .1576843
        655  |   .1056509   .0254808     4.15   0.000     .0541111    .1571908
        656  |   .1001278   .0166683     6.01   0.000      .066413    .1338426
        657  |  -.0139943   .0122413    -1.14   0.260    -.0387547    .0107661
        658  |  -.0291949   .0129481    -2.25   0.030    -.0553849   -.0030049
        659  |  -.0029472   .0119812    -0.25   0.807    -.0271816    .0212872
        660  |   .0314427   .0070823     4.44   0.000     .0171173    .0457681
        661  |   .0418853   .0134725     3.11   0.003     .0146346     .069136
        662  |   .0357219   .0126181     2.83   0.007     .0101994    .0612445
        663  |   .0524045   .0102159     5.13   0.000     .0317409     .073068
        664  |   .0519888   .0159836     3.25   0.002     .0196589    .0843186
        665  |   .0632551   .0174492     3.63   0.001     .0279608    .0985494
        666  |   .1123625   .0204524     5.49   0.000     .0709935    .1537314
        667  |   .0751594   .0327276     2.30   0.027     .0089616    .1413572
        668  |   .0963834   .0167287     5.76   0.000     .0625464    .1302203
        669  |  -.0312274   .0168636    -1.85   0.072    -.0653373    .0028825
        670  |  -.0610622   .0135754    -4.50   0.000    -.0885211   -.0336034
        671  |  -.0581864   .0122717    -4.74   0.000    -.0830084   -.0333645
        672  |  -.0089699   .0071606    -1.25   0.218    -.0234536    .0055139
        673  |  -.0003204   .0113484    -0.03   0.978    -.0232747    .0226338
        674  |   .0065615   .0070927     0.93   0.361    -.0077847    .0209078
        675  |   .0029572   .0114176     0.26   0.797    -.0201372    .0260515
        676  |   .0420712   .0150964     2.79   0.008     .0115359    .0726065
        677  |   .0664162   .0235513     2.82   0.008     .0187793    .1140531
        678  |   .0984766   .0217094     4.54   0.000     .0545653     .142388
        679  |   .1158478   .0186723     6.20   0.000     .0780795    .1536162
        680  |   .0971977   .0188399     5.16   0.000     .0590905    .1353049
        681  |   -.036795   .0113459    -3.24   0.002    -.0597443   -.0138456
        682  |  -.0361645   .0121919    -2.97   0.005     -.060825   -.0115041
        683  |  -.0352503   .0097296    -3.62   0.001    -.0549303   -.0155704
        684  |   .0062043   .0071232     0.87   0.389    -.0082037    .0206123
        685  |   .0080086   .0125029     0.64   0.526     -.017281    .0332982
        686  |   .0217406    .016922     1.28   0.206    -.0124874    .0559687
        687  |   .0183962   .0131829     1.40   0.171    -.0082688    .0450612
        688  |   .0660828   .0144702     4.57   0.000      .036814    .0953515
        689  |   .1086441   .0232687     4.67   0.000     .0615786    .1557096
        690  |   .1163525    .017023     6.84   0.000     .0819202    .1507848
        691  |   .0463268   .0272627     1.70   0.097    -.0088173    .1014709
        692  |   .0003366   .0249226     0.01   0.989    -.0500742    .0507474
        693  |  -.0710123   .0171997    -4.13   0.000    -.1058019   -.0362226
        694  |  -.0934697   .0115706    -8.08   0.000    -.1168733    -.070066
        695  |  -.0592158   .0149509    -3.96   0.000    -.0894567   -.0289748
        696  |   .0334643   .0078642     4.26   0.000     .0175575    .0493711
        697  |   .0343258   .0089265     3.85   0.000     .0162702    .0523814
        698  |   .0440548   .0104999     4.20   0.000     .0228167     .065293
        699  |   .0566927   .0132234     4.29   0.000      .029946    .0834395
        700  |   .0443315   .0193452     2.29   0.027     .0052021    .0834609
        701  |   .0745565   .0166422     4.48   0.000     .0408944    .1082186
        702  |   .0682959   .0128079     5.33   0.000     .0423895    .0942024
             |
       _cons |   3.165206   .3159832    10.02   0.000      2.52607    3.804343
-------------+----------------------------------------------------------------
     sigma_u |  .03328109
     sigma_e |    .065315
         rho |  .20612146   (fraction of variance due to u_i)
------------------------------------------------------------------------------
(est1 stored)

. 
. esttab using "STATA\results\py_temp\py_result.csv", cells("b(fmt(4)) se(fmt(4
> )) p(fmt(4)star)") replace r2 plain
(output written to STATA\results\py_temp\py_result.csv)

. 
. predict predictions, xb //predictions 
(644 missing values generated)

. predict predictions_u, xbu //predictions plus the fixed effect
(644 missing values generated)

. predict residuals, residual //residuals from standardized errors?
(644 missing values generated)

. predict stnderror, stdp //standardized error
(644 missing values generated)

. predict u, u
(644 missing values generated)

. predict e, e
(644 missing values generated)

. export delimited locale date month year dateid x y `y' weight count price adj
> _price adj_revenue lat lon predictions predictions_u residuals stnderror u e 
> /// 
>         using "STATA\outputs\py_temp\pyout.csv", replace
file STATA\outputs\py_temp\pyout.csv saved

. 
. clear

. 
end of do-file
